Revit 2026 API

# TileTileVerticalCount Property

---

The property labeled "tile_VerticalCount" from the "Tile" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TileVerticalCount { get; }
```
```vb
Public Shared ReadOnly Property TileVerticalCount As String
	Get
```
```cpp
public:
static property String^ TileVerticalCount {
	String^ get ();
}
```
```fsharp
static member TileVerticalCount : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble" within the range of "0, 100".

#### Reference

Tile Class

Autodesk.Revit.DB.Visual Namespace